# Consistency checks - Customers

### List of contents
    1. Importing file
    2. Renaming Columns
    3. Changing column type
    4. Missing values?
    5. Mixed Data type?
    6. Duplicates?
    7. Addressing Personal Information
    8. Final check
    9. Exporting files

## Importing libraries

In [4]:
import pandas as pd
import numpy as np
import os

## Creating path for folder

In [8]:
path = r'/Users/ceciliamoura/Desktop/Career Foundry/Achievement4/Instacart Basket Analysis'

## Importing file

In [11]:
# Importing original file - customers

In [26]:
customer = pd.read_csv(os.path.join (path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

In [28]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [30]:
customer.shape

(206209, 10)

In [32]:
customer.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## 2.Renaming columns

In [36]:
# renaming ['STATE'] as ['State']

customer.rename(columns={'STATE' : 'State'}, inplace = True)

In [38]:
# checking procedures

customer.head()

,user_id,First Name,Surnam,Gender,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 3. Changing column type

In [44]:
# 'user_id' changed from int64 to object

customer['user_id'] = customer['user_id'].astype('str')

In [46]:
# checking procedures

customer.dtypes

user_id         object
First Name      object
Surnam          object
Gender          object
State           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## 4. Missing values?

In [61]:
customer.isnull().sum()

user_id         0
First Name      0
Surnam          0
Gender          0
State           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

## 5. Mixed data types?

In [55]:
#check for mixed type

for col in customer.columns.tolist():
  weird = (customer[[col]].map(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

First Name

In [57]:
# Fixing mixed type column ['First name'] as object

customer['First Name'] = customer['First Name'].astype('str')

In [59]:
#checking

customer['First Name'].dtype

dtype('O')

## 6. Duplicates?

In [64]:
customer_dups = customer[customer.duplicated()]

In [66]:
customer_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, State, Age, date_joined, n_dependants, fam_status, income]
Index: []

In [68]:
#no duplicates found

## 7. Addressing Personal Information

In [74]:
# I decided to use a subset without first and last name to protect personal information

In [78]:
customer.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'State', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [82]:
# Creating a new subset

customer_secured = customer.drop(columns = ['First Name', 'Surnam'])

In [90]:
customer_secured.columns

Index(['user_id', 'Gender', 'State', 'Age', 'date_joined', 'n_dependants',
       'fam_status', 'income'],
      dtype='object')

## 8. Final Check

In [94]:
customer_secured.shape

(206209, 8)

## 9. Exporting clean file

In [97]:
customer_secured.to_csv(os.path.join(path,'Data','Final Prepared Data', 'customer_secured_clean.csv'))